package game.rooms.gameroom 
{
	/**
	 * ...
	 * @author ... Gospodin.Sorokin
	 */
	public class TextBase 
	{
		private var _array:Array = [
							  [["Все переплетено, море нитей, но. Потяни за нить, за ней потянется клубок. Это мир - веретино, совпадений - ноль. Нитей быть или струной, или для битвы титевой. Все переплетено, в единый моток. Нитевой комок и неситцевый платок."],["OXXXYMIRON. ПЕРЕПЛЕТЕНО"]]
							 ,[["Гостиная Анны Павловны начала понемногу наполняться. Приехала высшая знать Петербурга, люди самые разнородные по возрастам и характерам, но одинаковые по обществу, в каком все жили;"],["Толстой Лев Николаевич. Война и мир"]]
							 ,[["Мсье Пьер не знал, кому отвечать, оглянул всех и улыбнулся. Улыбка у него была не такая, какая у других людей, сливающаяся с неулыбкой."],["Толстой Лев Николаевич. Война и мир"]]
							 ,[["Хотя и непонятно было, для чего он его рассказывает и для чего его надо было рассказать непременно по-русски, однако Анна Павловна и другие оценили светскую любезность князя Ипполита, так приятно закончившего неприятную и нелюбезную выходку мсье Пьера."],["Л. Н. Толстой. Война и мир"]]
							 ,[["Что же это он, за свою прежнюю казенщину принимается, что ли! - с отвращением подумалось Раскольникову. Вся недавняя сцена последнего их свидания внезапно ему припомнилась, и тогдашнее чувство волною прихлынуло к его сердцу."],["Ф. М. Достоевский. Преступление и наказание"]]
							 ,[["Всё это я от Миколки и от зарайских его узнал. Да куды! просто в пустыню бежать хотел! Рвение имел, по ночам богу молился, книги старые, истинные читал и зачитывался."],["Ф. М. Достоевский. Преступление и наказание"]]
							 ,[["Недоверчиво и даже с аффектацией некоторого испуга, чуть ли даже не оскорбления, озирал он тесную и низкую морскую каюту Раскольникова."],["Ф. М. Достоевский. Преступление и наказание"]]
							 ,[["Даже прелестная пара сиреневых, настоящих жувеневских, перчаток свидетельствовала то же самое, хотя бы тем одним, что их не надевали, а только носили в руках для параду."],["Ф. М. Достоевский. Преступление и наказание"]]
							 ,[["В каменном доме, на дворе с остатками разобранного забора, выбитыми частью рамами и стеклами, помещался госпиталь. Несколько перевязанных, бледных и опухших солдат ходили и сидели на дворе на солнышке."],["Толстой Лев Николаевич. Война и мир"]]
							 ,[["18 марта 1965 года советский космонавт Алексей Архипович Леонов совершил первый в истории человечества выход в открытый космос."],["Интересные факты о России"]]
							 ,[["В России находится самый большой в мире действующий вулкан - Ключевская Сопка. Его высота 4850 метров. Он выбрасывает столбы пепла на восемь километров вверх. Извергается вулкан Ключевская Сопка на протяжении последних 7000 лет."],["Интересные факты о России"]]
							 ,[["В Санкт-Петербурге мостов в три раза больше, чем в Венеции. По количеству каналов и мостов уместнее не Петербург называть Северной Венецией, а Венецию - Южным Петербургом."],["Интересные факты о России"]]
							 ,[["Транссибирская железнодорожная магистраль - самая длинная железная дорога в мире. Великий Сибирский Путь, соединяющий Москву с Владивостоком, в длину имеет 9298 километров."],["Интересные факты о России"]]
							 ,[["Сибирское озеро Байкал - самое глубокое озеро в мире и самый крупный источник пресной воды на планете. В Байкале 23 кубических километра воды."],["Интересные факты о России"]]
							 ,[["Россию отделяют от Америки 4 километра. Это расстояние между островом Ратманова (Россия) и островом Крузенштерна (США) в Беринговом проливе."],["Интересные факты о России"]]
							 ,[["В Санкт-Петербурге 2000 библиотек, 221 музей, 100 концертных организаций, больше 80 театров, 80 клубов и домов культуры, 62 кинотеатра, 45 картинных галерей."],["Интересные факты о России"]]
							 ,[["Урал - самые старые горы в мире. Расположенная в Кусинском районе у деревни Александровка гора Карандаш возникла 4,2 миллиарда лет назад."],["Интересные факты о России"]]
							 ,[["Московский Кремль - самая большая в мире средневековая крепость. Полная длина кремлевских стен составляет 2235 метров."],["Интересные факты о России"]]
							 ,[["В Москве есть большой фонтан, из которого бьёт питьевая вода. Фонтан входит в архитектурную группу Александр и Натали со скульптурной композицией Пушкина и Гончаровой в изящной ротонде."],["Интересные факты о России"]]
							 ,[["Россия провозгласила равные права мужчин и женщин раньше, чем США. В России избирательное право женщинам предоставили в 1918-м году, в Соединённых штатах - в 1920-м."],["Интересные факты о России"]]
							 ,[["16 января 1820 года русская экспедиция Таддеуса Беллинсгаузена и Михаила Лазарева обнаружила Антарктиду."],["Интересные факты о России"]]
							 ,[["Иван Грозный не был тираном, он казнил в 100 раз меньше людей, чем его европейские коллеги - 3-4 тысячи человек против 300-400 тысяч человек."],["Интересные факты о России"]]
							 ,[["Поезда в Московском метро ходят чаще, чем в любом другом метро мира. В часы пик интервал между составами в нём составляет 90 секунд."],["Интересные факты о России"]]
							 ,[["В Петергофе под Санкт-Петербургом 176 фонтанов, из которых 40 гигантских, и 5 каскадов."],["Интересные факты о России"]]
							 ,[["Советский космонавт Юрий Гагарин был первым человеком, побывавшим в космосе."],["Интересные факты о России"]]
							 ,[["Во время Второй мировой войны станции метро использовались как бомбоубежища. Во время авианалётов в этом совершенно безопасном укрытии родились 150 человек."],["Интересные факты о России"]]
							 ,[["Некоторое время назад в Москве было больше миллиардеров, чем в любом другом городе мира. Сейчас миллиардеров в Москве стало меньше"],["Интересные факты о России"]]
							 ,[["Российская Публичная библиотека - крупнейшая в Европе и вторая в мире после Библиотеки Конгресса США. Она расположена в Москве, была основана в 1862 году."],["Интересные факты о России"]]
							 ,[["В 2002-м году по рейтингу ЮНЕСКО Екатеринбург вошёл в список 12-ти идеальных городов мира."],["Интересные факты о России"]]
							 ,[["Японское блюдо суши в России популярнее, чем в Японии."],["Интересные факты о России"]]
							 ,[["В новосибирском Институте цитологии и генетики СОРАН за последние 50 лет вывели домашних лисиц, преданных, как собаки, и независимых, как кошки."],["Интересные факты о России"]]
							 ,[["В России как минимум 15 секретных городов. Их нет на картах, к ним не ведут дорожные указатели и к ним даже близко не подпустят иностранцев."],["Интересные факты о России"]]
							 ,[["В 30-х годах в реке Тихая Сосна возле Белгорода русские рыбаки поймали осетра, в котором было 245 килограммов чёрной икры."],["Интересные факты о России"]]
							 ,[["В 1975-1982 годах в рамках космической программы Венера на эту планету приземлились шесть автоматических межпланетных космических аппаратов."],["Интересные факты о России"]]
							 ,[["Перед революцией русская семья была одной из крупнейших в мире. В России считалось, что 8 детей в семье - это мало. Нормально было иметь 12-14 детей."],["Интересные факты о России"]]
							 ,[["Каждый монарх династии Романовых оставил своему наследнику страну большего размера, чем получил от отца."],["Интересные факты о России"]]
							 ,[["При Иване Грозном в России содержание алкоголя в различных хмельных напитках составляло от 1 до 6%. Пили по праздникам не чаще двух раз в месяц."],["Интересные факты о России"]]
							 ,[["Русский космонавт Сергей Крикалёв установил рекорд пребывания в космосе - 803 дня. Основоположник жанра космической фотографии."],["Интересные факты о России"]]
							 ,[["В царской России вплоть до 1917 года любой желающий мог купить револьвер в лавке так же свободно, как буханку хлеба."],["Интересные факты о России"]]
							 ,[["Садово-парковая зона в Москве намного больше, чем в западных мегаполисах. Заложенный в 1931 году Измайловский парк - один из крупнейших городских парков в мире."],["Интересные факты о России"]]
							 ,[["Крупнейший европейский ботанический сад - основанный в 1945 году Главный ботанический сад имени Н. В. Цицина РАН."],["Интересные факты о России"]]
							 ,[["Самое высокое европейское здание - Останкинская телебашня в Москве."],["Интересные факты о России"]]
							 ,[["Три четверти россиян живут в городах. Пятёрка самых крупных городов России - Москва, Санкт-Петербург, Новосибирск, Екатеринбург и Нижний Новгород."],["Интересные факты о России"]]
							 ,[["У России самые большие запасы природного газа, торфа, леса, соли, питьевой воды, крабов, осетра, олова, цинка, титана, ниобия, никеля, железных руд, алмазов, серебра."],["Интересные факты о России"]]
							 ,[["Россия занимает первое место в мире по добыче нефти и газа, экспорту стали, первичного алюминия, азотных удобрений."],["Интересные факты о России"]]
							 ,[["В России 103 заповедника, 43 гигантских национальных парка и 70 заказников, что составляет 4% всей площади страны."],["Интересные факты о России"]]
							 ,[["В России шахматы популярнее футбола."],["Интересные факты о России"]]
							 ,[["В Санкт-Петербурге самая большая в мире трамвайная сеть. Её протяжённость 690 километров."],["Интересные факты о России"]]
							 ,[["Самый большой в мире лес - сибирская тайга."],["Интересные факты о России"]]
							 ,[["С точки зрения международного права Россия и Япония находятся в состоянии войны со времён Второй мировой."],["Интересные факты о России"]]
							 ,[["В мае 1990-го года газета Комсомольская правда установила абсолютный и теперь уже, видимо, вечный рекорд тиража бумажной газеты в 22 миллиона экземпляров."],["Интересные факты о России"]]
							 ,[["В 2005-м году весёлый ульяновский губернатор Сергей Морозов объявил 12 сентября выходным днём зачатия. В июне 2006-го года рождаемость подскочила втрое."],["Интересные факты о России"]]
							 ,[["Государственный музей Эрмитаж для защиты от грызунов держит стаю кошек. У каждой кошки Эрмитажа есть паспорт с фотографией."],["Интересные факты о России"]]
							 ,[["В России, под Магнитогорском, есть гора Магнитная, почти полностью железная."],["Интересные факты о России"]]
							 ,[["В Москве есть бродячие собаки, которые ездят в метро ежедневно по одному и тому же маршруту. Они знают, где и когда можно вкусно поесть."],["Интересные факты о России"]]
							 ,[["Территория Тамбовской области равна совокупным территориям Бельгии и Нидерландов."],["Интересные факты о России"]]
							 ,[["Старейший город России, дагестанский Дербент - один из старейших ныне живущих городов мира."],["Интересные факты о России"]]
							 ,[["У России второе место после Китая по количеству военных."],["Интересные факты о России"]]
							 ,[["В России самый высокий в мире охват населения школьным образованием."],["Интересные факты о России"]]
							 ,[["По пиратскому использованию программного обеспечения Россия занимает скромное 37 место. Мировой лидер в этом деле - Армения."],["Интересные факты о России"]]
							 ,[["Металл каркаса Статуи Свободы выплавлен в Нижнем Тагиле."],["Интересные факты о России"]]
							 ,[["Россия - преемница Римской Империи. Двуглавый орёл символизирует византийскую идею симфонии властей. Слово царь произошло от слова цезарь."],["Интересные факты о России"]]
							 //,[[""],[""]]
							 //,[[""],[""]]
							 //,[[""],[""]]
							 //,[[""],[""]]
							 //,[[""],[""]]
							 //,[[""],[""]]
							 //,[[""],[""]]
							 //,[[""],[""]]
							 //,[[""],[""]]
							 //,[[""],[""]]
							 ]
		public function TextBase()
		{
			
		}
		public function getText() :Array
		{
			return (_array[Math.round(Math.random() * (_array.length - 1))]);	
		}
		
	}

}